// 이용 약관 텍스트
const termsOfUsing = `
무코 개인정보 취급방침

무코(이하 "회사" 또는 "무코"라 함)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법, 전기통신사업법, 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.
 
1. 수집하는 개인정보의 항목 및 수집방법
2. 개인정보의 수집 및 이용목적
3. 개인정보 제공 및 공유
4. 개인정보의 보유 및 이용기간
5. 개인정보 파기절차 및 방법
6. 이용자 및 법정대리인의 권리와 그 행사방법
7. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항
8. 개인정보의 기술적/관리적 보호 대책
9. 개인정보관리책임자 및 담당자의 연락망
10. 기타
11. 고지의 의무


1. 수집하는 개인정보의 항목 및 수집방법
 
가. 수집하는 개인정보의 항목
회사는 회원가입(또는 서비스 가입), 원활한 고객상담, 각종 서비스의 제공을 위해 무코 서비스 최초 이용시 다음과 같은 개인정보 수집하고 있습니다.

- 필수: 이메일, 단말기 정보
- 선택: 서비스 이용 도중 이용자 선택에 따라 본인의 SNS 계정 등을 연결하기 위한 계정정보를 입력할 수 있습니다.
 
마지막으로, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.
 
- IP Address, 방문 일시, 서비스 이용 기록
 
나. 개인정보 수집방법
회사는 다음과 같은 방법으로 개인정보를 수집합니다.

- 무코 프로그램의 실행 또는 사용 과정에서 수집
- 생성정보 수집 툴을 통한 수집

 
2. 개인정보의 수집 및 이용목적
 
회사는 수집한 개인정보를 다음과 같은 목적으로 이용합니다.
 
가. 무코 서비스 제공
이용자가 가입한 무코 내 상호 식별
 
나. 회원관리
회원제 서비스 제공, 회원식별, 불량회원(무코 이용약관 제8조에 따라 이용제한된 회원)의 부정 이용방지와 비인가 사용방지, 가입의사 확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달
 
다. 신규 서비스 개발 및 마케팅 · 광고에의 활용
신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 이벤트 참여기회 제공 또는 광고성 정보 제공, 접속빈도 파악, 회원의 서비스이용에 대한 통계

 
3. 개인정보의 제공 및 공유
 
회사는 이용자들의 개인정보를 원칙적으로 "2. 개인정보의 수집목적 및 이용목적"에서 고지한 범위 내에서 사용합니다.
 
상기 목적 이외에는 이용자의 사전 동의 없이 "2. 개인정보의 수집목적 및 이용목적"에서 고지한 범위를 넘어서 이용하거나 원칙적으로 이용자의 개인정보를 외부에 공개하지 않습니다. 단, 아래의 경우에는 예외로 합니다.
 
- 이용자가 사전에 동의한 경우
- 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

 
4. 개인정보의 보유 및 이용기간
 
이용자의 개인정보는 원칙적으로 계정 삭제시 또는 개인정보의 수집 및 이용목적 달성시 지체없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.

 
5. 개인정보 파기절차 및 방법
 
이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 회사의 개인정보 파기절차 및 방법은 다음과 같습니다.
 
가. 파기절차
이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간 저장된 후 파기됩니다.
동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.

나. 파기방법
전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

 
6. 이용자 및 법정대리인의 권리와 그 행사방법

이용자는 무코의 “계정 정보”, “회원탈퇴” 메뉴 및 회사에 대해 전자우편을 통하여 권리 행사를 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.

이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며, 회사의 개인정보의 처리에 동의하지 않는 경우 동의를 거부하거나 가입해지(회원탈퇴)를 요청하실 수 있습니다. 또한, 데이터 삭제를 요청할 수 있습니다. 다만, 그러한 경우 서비스의 일부 또는 전부 이용이 어려울 수 있습니다.

이용자가 자신의 개인정보를 조회하거나, 수정하기 위해서는 애플리케이션 내 '설정'을, 가입해지(동의철회)를 위해서는 "설정 > 계정 > 탈퇴하기"를 클릭하여 직접 열람, 정정 또는 탈퇴가 가능합니다. 혹은 개인정보관리책임자에게 이메일로 연락하시면 지체 없이 조치하겠습니다.

회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 "5. 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

이용자에 따른 권리 행사는 이용자의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 위임장을 제출하셔야 합니다.

이용자는 개인정보 보호 유관법령을 위반하여 회사가 처리하고 있는 이용자 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니됩니다.

 
7. 개인정보 자동 수집 장치의 설치/운영 및 그 거부에 관한 사항
 
무코 서비스는 개인정보 자동 수집 장치(쿠키)를 이용하지 않습니다.
 

8. 개인정보의 기술적/관리적 보호 대책
 
회사는 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.
 
가. 개인정보의 암호화
회사는 관련 법률규정 또는 내부정책에 따라 개인정보를 암호화하여 안전하게 저장 및 관리하고 있습니다.
 
나. 해킹 등에 대비한 대책
회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다. 
침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.
 
다. 취급 직원의 최소화 및 교육
회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 윌림 개인정보취급방침의 준수를 항상 강조하고 있습니다.
 
라. 개인정보보호전담기구의 운영
그리고 사내 개인정보보호전담기구 등을 통하여 무코 개인정보취급방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 수정하고 바로 잡을 수 있도록 노력하고 있습니다.
 
단, 이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.
 

9. 개인정보관리 책임자 및 담당자의 연락망
 
귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리 책임자 혹은 담당부서로 신고하실 수 있습니다:

무코

    수신: 개인정보관리책임자

    이메일: moodbarcode@gmail.com

기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
 
- 개인정보침해신고센터 (http://www.118.or.kr / 국번없이 118)
- 대검찰청 사이버범죄수사단 (http://www.spo.go.kr / 02-3480-2000 )
- 경찰청 사이버테러대응센터 ( http://www.ctrc.go.kr / 1566-0112 )
 
10. 기타
 
무코 서비스 내에 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 본 "무코 개인정보취급방침"이 적용되지 않음을 알려 드립니다.
 
11. 고지의 의무
 
현 개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 회사 홈페이지, 서비스 내의 '공지사항' 또는 기타 알기쉬운 방법을 통해 고지할 것입니다. 다만, 개인정보의 수집 및 활용, 제3자 제공 등과 같이 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에 고지합니다.
 
제정일자 : 2024년 03월 18일
`;


export default termsOfUsing;